app/Controllers/Admin.php

    public function index()
    {
        $produkModel = new ProdukModel();
        $orderModel  = new OrderModel();
        $ulasanModel = new UlasanModel();

        $data = [
            'totalProduk'  => $produkModel->countAll(),
            'totalPesanan' => $orderModel->countAll(),
            'totalUlasan'  => $ulasanModel->countAll(),

            // ORDERS
            'recentOrders' => $orderModel
                ->orderBy('created_at', 'DESC')
                ->findAll(5),

            // ULASAN (FIX HERE)
            'recentUlasan' => $ulasanModel
                ->orderBy('id_ulasan', 'DESC')
                ->findAll(5),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `produk`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows` FROM `ulasan`
SELECT *
FROM `orders`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `ulasan`
ORDER BY `id_ulasan` DESC
 LIMIT 5

public function ulasan()
{
    $ulasanModel = new \App\Models\UlasanModel();

    $keyword = $this->request->getGet('keyword');
    $produk  = $this->request->getGet('produk');
    $rating  = $this->request->getGet('rating');

    $builder = $ulasanModel;

    if ($keyword) {
        $builder = $builder->like('nama_user', $keyword)
                           ->orLike('komentar', $keyword);
    }

    if ($produk) {
        $builder = $builder->where('id_produk', $produk);
    }

    if ($rating) {
        $builder = $builder->where('rating', $rating);
    }

    $data = [
        'ulasan' => $builder->orderBy('id_ulasan', 'DESC')->findAll(),
        'produkList' => (new \App\Models\ProdukModel())->findAll()
    ];
---
SELECT *
FROM `ulasan`
WHERE `id_produk` = '1'
ORDER BY `id_ulasan` DESC
SELECT *
FROM `produk`

 public function order()
{
    $db = \Config\Database::connect();

    $bulan = $this->request->getGet('bulan');

    $orders = $db->table('orders')
        ->select('
            orders.*,
            kurir.nama_penerima,
            kurir.catatan_pengiriman,
            kurir.foto_bukti,
            kurir.tanggal_kirim
        ')
        ->join('kurir', 'kurir.order_id = orders.id', 'left')
        ->orderBy('orders.created_at', 'DESC')
        ->get()
        ->getResultArray();
---
SELECT `orders`.*, `kurir`.`nama_penerima`, `kurir`.`catatan_pengiriman`, `kurir`.`foto_bukti`, `kurir`.`tanggal_kirim`
FROM `orders`
LEFT JOIN `kurir` ON `kurir`.`order_id` = `orders`.`id`
ORDER BY `orders`.`created_at` DESC

public function produk()
{
    $model = new ProdukModel();

    $data = [
        'produk' => $model->orderBy('id_produk', 'DESC')->findAll()
    ];
---
SELECT *
FROM `produk`
ORDER BY `id_produk` DESC