app/Controllers/ProfileController.php

SELECT *
FROM `orders`
WHERE `user_id` = '7'
ORDER BY `id` DESC
---
    public function index()
    {
        $orderModel = new OrderModel();

        $userId = session()->get('user_id');

        $data['orders'] = $orderModel
            ->where('user_id', $userId)
            ->orderBy('id', 'DESC')
            ->findAll();